---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSurfaceElementsMark
source: html/bfdf53a0-3b94-30c2-ce83-b6f757bd9af0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSurfaceElementsMark Property

"Surface Number": Used for floors, slabs, walls

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelSurfaceElementsMark { get; }
```